{
  "дисциплина": "Базы данных",
  "рабочая программа": {
    "компетенции": [
      "УК-1",
      "УК-2",
      "ОПК-1",
      "ОПК-2",
      "ОПК-6",
      "ПК-1",
      "ПК-3",
      "ПК-7"
    ],
    "цели": [
      "Получение теоретических знаний и практических навыков разработки баз данных",
      "Знакомство с моделями данных, принципами нормализации отношений",
      "Приобретение знаний о реляционной алгебре и реляционном исчислении и внутренней организации реляционной СУБД"
    ],
    "задачи": [
      "Выработка практических навыков применения СУБД для проектирования и разработки баз данных",
      "Изучение основных принципов организации баз данных"
    ],
    "семестры": [
      {
        "номер": 3,
        "разделы": [
          {
            "номер": 1,
            "название": "Основные концепции построения баз данных",
            "содержание": "Общее представление о системе баз данных. Понятие физической и логической независимости. Реляционная модель данных: свойства модели, установление связей между отношениями.",
            "лекции": [
              {
                "тема": "Общее представление о системе баз данных. Типовая организация СУБД. Поддержание целостности в реляционной модели данных. Нормализация отношений. Примеры.",
                "часы": 2
              },
              {
                "тема": "Синтаксис языка SQL. Использование языка QBE. Основные возможности СУБД Access.",
                "часы": 2
              }
            ],
            "практические": [
              {
                "тема": "Интерфейс базы данных в Access. Создание таблицы. Установка связей между таблицами.",
                "часы": 4
              },
              {
                "тема": "Формирование простого запроса на выборку. Использование языка SQL.",
                "часы": 4
              },
              {
                "тема": "Построение сводных таблиц. Обработка данных с использованием итоговых операций.",
                "часы": 4
              }
            ],
            "вопросы": [
              "Поддержание целостности в Access. Виды объединения таблиц.",
              "Архитектура системы базы данных, уровни абстракций в СУБД",
              "Аномалии в реляционных базах данных. Нормализация схем отношений."
            ]
          },
          {
            "номер": 2,
            "название": "Разработка баз данных средствами СУБД Access",
            "содержание": "Реализация в Access поддержки целостности данных, связей между таблицами, использование индексных файлов, ключей. Использование мастеров и конструкторов.",
            "лекции": [
              {
                "тема": "Использование мастеров, конструкторов и построителей выражений для разработки приложений. Аномалии. Виды запросов. Создание запросов в Access.",
                "часы": 2
              }
            ],
            "практические": [
              {
                "тема": "Поддержание целостности. Исключение избыточности данных. Экспорт/импорт в Access.",
                "часы": 4
              },
              {
                "тема": "Определение последовательности заполнения таблиц. Разработка составных форм с использованием диалоговых элементов управления. Составление отчетов.",
                "часы": 4
              }
            ],
            "вопросы": [
              "Контроль вводимых данных. Подстановка значений в поля таблицы.",
              "Реализация связей между таблицами в Access. Первичный и внешний ключи."
            ]
          },
          {
            "номер": 3,
            "название": "Современные тенденции развития СУБД. Защита данных. Блокировка записей.",
            "содержание": "Технологии файл-сервер и клиент-сервер. Определение транзакций. Автоматизация работы с помощью макросов.",
            "лекции": [
              {
                "тема": "Технологии файл-сервер и клиент-сервер. Определение транзакций.",
                "часы": 2
              },
              {
                "тема": "Виды блокировок используемых для совместной работы пользователей.",
                "часы": 2
              }
            ],
            "практические": [
              {
                "тема": "Создание свободных и внедренных макросов. Включение условий в макросы.",
                "часы": 4
              },
              {
                "тема": "Использование режима файл-сервер для работы нескольких пользователей. Проверка различных режимов блокировок.",
                "часы": 2
              }
            ],
            "вопросы": [
              "Средства защиты информации в СУБД. Организация защиты данных в Access.",
              "Виды блокировок в Access. Задание блокировок в формах."
            ]
          }
        ]
      },
      {
        "номер": 4,
        "разделы": [
          {
            "номер": 4,
            "название": "Использование языка Visual Basic for Applications",
            "содержание": "Преимущества модулей перед макросами. Преобразование макросов в модули. Структура программ VBA.",
            "лекции": [
              {
                "тема": "Создание модулей в Access. Язык VBA.",
                "часы": 2
              },
              {
                "тема": "Процедуры и функции. Передача параметров. Объектные переменные. Примеры обработки событий.",
                "часы": 2
              }
            ],
            "практические": [
              {
                "тема": "Преобразование макросов в модули. Отладка программ в редакторе VBA.",
                "часы": 2
              },
              {
                "тема": "Создание процедур обработки событий на VBA. Создание функций. Область действия переменных.",
                "часы": 2
              },
              {
                "тема": "Ссылки на объекты Access, объектная модель DAO. Управление объектами с помощью методов и свойств.",
                "часы": 4
              },
              {
                "тема": "Ссылки на объекты. Примеры использования объектов. Ссылка в объектной модели DAO.",
                "часы": 4
              }
            ],
            "вопросы": [
              "Управляющие конструкции языка VBA: операторы цикла, условный оператор.",
              "Преобразование макросов в модули. Добавление обработки ошибок."
            ]
          },
          {
            "номер": 5,
            "название": "Объектные модели доступа к данным",
            "содержание": "Объектная библиотека Access и Microsoft Office. Подключение объектных библиотек. Объектная модель DAO.",
            "лекции": [
              {
                "тема": "Объектная библиотека Access и Microsoft Office. Объектная модель доступа к данным DAO.",
                "часы": 2
              },
              {
                "тема": "Статические и динамические наборы. Перемещение по набору записей.",
                "часы": 2
              }
            ],
            "практические": [
              {
                "тема": "Методы и свойства объектов Access. Управление посредством группы переключателей. Обновление данных в подчиненной форме.",
                "часы": 4
              },
              {
                "тема": "Примеры обработки событий форм и отчетов. Программирование форм и отчетов.",
                "часы": 4
              },
              {
                "тема": "Задания на программирование с использованием объектов Recordset. Доступ к данным.",
                "часы": 2
              }
            ],
            "вопросы": [
              "Объектная модель DAO. Методы и свойства объектов RecordSet.",
              "Обработка событий в формах и отчетах."
            ]
          },
          {
            "номер": 6,
            "название": "Доступ к данным. Работа с текущей базой данных",
            "содержание": "Соединение с базой данных. Статические и динамические наборы. Использование свойств Recordset.",
            "лекции": [
              {
                "тема": "Соединение с базой данных. Доступ к таблицам и их изменение. Применение набора Recordset.",
                "часы": 2
              }
            ],
            "практические": [
              {
                "тема": "Возможности обработки записей. Пошаговое выполнение программ.",
                "часы": 2
              },
              {
                "тема": "Статические и динамические наборы. Перемещение по набору записей. Объектная модель ADO.",
                "часы": 4
              },
              {
                "тема": "Синхронизация списков, множественный выбор в списках. Использование свойств Recordset и RecordsetClone.",
                "часы": 4
              },
              {
                "тема": "Задание парольной защиты для базы данных с использование операторов VBA.",
                "часы": 2
              }
            ],
            "вопросы": [
              "Доступ к данным через объектную модель ADO.",
              "Использование операторов SQL в VBA."
            ]
          }
        ]
      }
    ]
  }
}